"""
存放常量
"""

# # 增加列调整因子
# 存储数据时使用因子调整为整数uint32，读取时使用因子倒数调整回原始数据
# 可简化代码及提高存取速度
# 防止数据溢出，尽量保持原有数据精度。

ADJUST_FACTOR = {'turnover':10000,       # 换手率为百分比34.78 代表 34.78%
                 #'change_pct':10000,    # _read_bcolz_data只处理uint32, change_pct为int32
                 'open':1000,
                 'high':1000,
                 'low':1000,
                 'close':1000,
                 'prev_close':1000,
                 'amount':0.0001,
                 'volume':0.0001,         # 指数数据须缩小，否则会溢出
                 'cmv':0.0001,
                 'tmv':0.0001}

# 包含退市或暂停上市股票代码
TEST_SIDS = frozenset([1, 33, 155, 333, 792, 
                       2006, 2071, 2146, 2209, 2024,
                       300001, 300354, 300422, 300536, 300692,
                       600000, 600432, 600645, 601857, 601398,
                       # 指数sid
                       499001])
